name: "pyannote-vad"
platform: "onnxruntime_onnx"
max_batch_size: 8
version_policy: { all: {} }

input [
  {
    name: "input_values"
    data_type: TYPE_FP32
    dims: [1, -1]
  }
]

output [
  {
    name: "logits"
    data_type: TYPE_FP32
    dims: [-1, 7]
  }
]

instance_group [
  {
    count: 1
    kind: KIND_CPU
  }
]

dynamic_batching {
  preferred_batch_size: [1, 2, 4]
  max_queue_delay_microseconds: 1000
}
