# Конфигурация модели vosk-tts-elena для Triton Inference Server

name: "vosk-tts-elena"
platform: "python"
max_batch_size: 8

input [
  {
    name: "text"
    data_type: TYPE_STRING
    dims: [-1]
  },
  {
    name: "speed"
    data_type: TYPE_FP32
    dims: [1]
    optional: true
  },
  {
    name: "pitch"
    data_type: TYPE_FP32
    dims: [1]  
    optional: true
  },
  {
    name: "sample_rate"
    data_type: TYPE_FP32
    dims: [1]
    optional: true
  }
]

output [
  {
    name: "audio"
    data_type: TYPE_FP32
    dims: [-1]
  },
  {
    name: "sample_rate_out"
    data_type: TYPE_FP32
    dims: [1]
  }
]

parameters: {
  key: "EXECUTION_ENV_PATH",
  value: {string_value: "$$TRITON_MODEL_DIRECTORY"}
}

instance_group [
  {
    name: "vosk_tts_elena_0"
    kind: KIND_CPU
    count: 2
  }
]
